# 2) კომენტარებით ახსენით თუ რა არის custom ფუნქციები, რისთვის გამოვიყენებთ და რა დანიშნულება გააჩნიათ, ასევე ახსენით მისი შექმნის გზები ეტაპობრივად და ახსენეთ თუ რაა პარამეტრები და არგუმენტები.

# custom ფუნქციები არის პროგრამისტის შექმნილი ფუნქცია,რომელსაც ვიყენებთ იმისთვის, რომ ერთი და იგივე კოდი ბევრჯერ არ დავწეროთ.
# custom ფუნქციის შექმნის გზები:
# 1) def-ის  გაწერა.
# 2) ვარქმევთ ფუნქციას სახელს.
# 3) შემდეგ ვწერთ ფრჩხილებს .
# 4) ფრჩხილების შემდეგ კი ვწერთ ორმაგწერტილს.

#  არგუმენტები არის მნიშვნელობა,რომელიც გადაეცემა ფუნქციას მისი გამოძახებისას.
#  პარამეტრები არის ცვლადი,რომელიც ფუნქციის შექმნისას იწერება ფრჩხილებში

# 3) შექმენით ფუნქცია, რომელსაც გადაეცემა ორი რიცხვი. თქვენი დავალებაა დააბრუნოთ ამ ორი რიცხვის ჯამი.

def two_number(num1,num2):
    return num1 + num2

print(two_number(10,20))


# 4) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი. თქვენი დავალებაა შეამოწმოთ ამ რიცხვის ლუწობა. თუ იგი ლუწია, დაბეჭდეთ "რიცხვი ლუწია" სხვა შემთხვევაში "რიცხვი კენტია"


def number(num):
    if num % 2 == 0:
        print('რიცხვი ლუწია')
    else:
        print('რიცხვი კენტია')

number(2)
number(5)


# 5) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი. თქვენი დავალებაა დააბრუნოთ ამ რიცხვის კვადრატული მნიშნელობა.

def square(num):
    return num ** 2

print(square(4))


# 6) შექმენით ფუნქცია, რომელიც გადაცემულ ტექსტს აბრუნებს დიდი ასოებით.


def upper_word(text):
    return text.upper()


print(upper_word('hello world'))



# 7) შექმენით ფუნქცია, რომელსაც პარამეტრებად გადაეცემა სახელი და გვარი, თქვენი დავალებაა გამოიტანოთ მნიშვნელობები ერთი წინადადების სახით.

def full_name(name,surname):
    print(f'my name is {name} and my surname is {surname}.')

full_name('Tako','Zhorzholiani')



