# შექმენი სია სახელელად my_list სადაც ჩაწერ შენს საყვარელ 3 ხილს და 2 რიცხვს len() ფუნქციის დახმარებით დათვალე რამდენი ელემენტისგან შედგება შენი სია
# .append() მეთოდით სიის ბოლოში დაამატე ახალი ელემენტი: "apple".

# .insert() მეთოდით სიის მე-2 ადგილზე (ანუ ინდექსით 1) ჩასვი სიტყვა "banana".

# .pop() მეთოდის გამოყენებით წაშალე სიის პირველი ელემენტი (ინდექსით 0).

# .remove() მეთოდით წაშალე ელემენტი "apple".

# დაბეჭდე მიღებული სია, რათა შეამოწმო ცვლილებები.


my_list=['blueberry','banana','orange',7,10]

my_list_len=len(my_list)
print(my_list_len)

my_list.append('apple')
print(my_list)

my_list.insert(1,'banana')
print(my_list)

my_list.pop(0)
print(my_list)

my_list.remove('apple')
print(my_list)


# შექმენი სია სახელით students, სადაც ჩაწერ 4 შენი კლასელის სახელს.
# დაბეჭდე ეს სია და მიუწერე კომენტარი, თუ რას აკეთებს კოდის ეს ხაზი.
# .append() მეთოდით სიის ბოლოში სათითაოდ დაამატე კიდევ 2 სახელი.
# .insert() მეთოდით სიის თავში (ინდექსი 0) დაამატე მასწავლებლის სახელი.
# .insert() მეთოდით სიის მე-4 ადგილზე (ინდექსი 3) დაამატე სახელი `"ნიკოლოზი"
# დაბეჭდე განახლებული სია.


students=['daviti','demetre','nika','andria']
print(students) #ეს ხაზი ბეჭდავს students სიაში არსებულ ყველა ელემენტს.

students.append('saba')
students.append('elene')

students.insert(0,'batoni daviti')

students.insert(3,"ნიკოლოზი")

print(students)


# შექმენი ახალი რიცხვების სია ზუსტად ამ თანმიმდევრობით: data = [15, 40.2, 15, 5, 7, 10, 23, 15]
# დაბეჭდე თავდაპირველი სია.
# .count() მეთოდის გამოყენებით დაითვალე, რამდენჯერ მეორდება რიცხვი 15 ამ სიაში და დაბეჭდე პასუხი.
# .sort() მეთოდით დაალაგე ეს რიცხვები ზრდადობით და დაბეჭდე სია.
# .sort(reverse=True) მეთოდით დაალაგე იგივე რიცხვები კლებადობით და დაბეჭდე სია.
# გამოიყენე print(data[::-1]) და კომენტარით ახსენი, რატომ ამოატრიალა კოდმა სია უკუღმა.


data = [15, 40.2, 15, 5, 7, 10, 23, 15]
print(data)

print(data.count(15))

data.sort()
print(data)

data.sort(reverse=True)
print(data)

print(data[::-1])
# კოდმა სია უკუღმა იმიტომ ამოატრიალა რომ, -1 ნიშნავს ბოლოდან დაწყებას. 