#2) მომხმარებელს შემოაყვანინე სამი რიცხვი, ხოლო პროგრამამ დაბეჭდოს მათი საშუალო არითმეტიკული.


num_1 = int(input('შეიყვანეთ ნებისმიერი რიცხვი:'))
num_2 = int(input('შეიყვანეთ ნებისმიერი რიცხვი:'))
num_3 = int(input('შეიყვანეთ ნებისმიერი რიცხვი:'))
 
num_1 = 5
num_2 = 10
num_3 = 15

print((num_1 + num_2 + num_3 ) /3)


#3) მომხმარებელს შემოატანინე ორი რიცხვი და დაბეჭდე მათი ჯამი.


num_1 =int(input('შეიყვანეთ პირველი რიცხვი:'))
num_2 =int(input('შეიყვანეთ მეორე რიცხვი:'))

print(num_1 + num_2)


#4) input ფუნქციის საშუალებით შემოიყვანეთ თქვენი და თქვენი ოჯახის წევრების სახელები და დაპრინტეთ ერთი დიდი წინადადება კონკატენაციის სახით.


name =input('თქვენი სახელი:')
mother =input('დედის სახელი:')
father =input('მამის სახელი:')
print('მე ვარ ' + name + ' დედას ჰქვია ' + mother + ' და მამას ჰქვია ' + father )


#5) მომხმარებელს შემოატანინეთ მისი ქალაქის, უბნის, კორპუსის და სართულის შესახებ ინფორმაცია (რომლებიც უნდა შეინახოთ ცალ-ცალკე ცვლადებში). მაგ. city = "Tbilisi", District = "{თქვენი უბანი}" და ა.შ. საბოლოოდ print() ბრძანების საშუალებით ტერმინალში გამოიტანეთ მომხმარებლის სრული მისამართი.

city =input('შეიყვანეთ ქალაქი:')
District =input('შეიყვანეთ უბანი:')
building =input('შეიყვანეთ კორპუსი:')
floor =input('შეიყვანეთ სართული:')

print('მე ვცხოვრობ ქალაქში ' + city + ' უბანში ' + District + ' კორპუსი ' + building + ' სართული ' + floor )



#6) მომხმარებელს შემოატანინეთ ასაკი და ამოყენებითმსგავსი ფორმატის წინადადება: "You are ასაკი years old".


age = input('თქვენი ასაკი:')

print('you are ' + age + ' years old ')