# 2) მოცემულია რიცხვების სია. გამოიყენეთ slicing-ის ბიჯი (step), რათა სიიდან ამოიღოთ ყოველი მეორე რიცხვი.
# -- numbers_step = [5, 10, 15, 20, 25, 30, 35, 40] --

numbers_step = [5, 10, 15, 20, 25, 30, 35, 40]
print(numbers_step[0:8:2])

# 3) მოცემულია ხილის სია. გამოიყენეთ slicing, რათა ამოჭრათ და მიიღოთ მხოლოდ შუაში მყოფი 3 ხილი.
# -- fruits = ["ვაშლი", "მსხალი", "ატამი", "ბალი", "ყურძენი", "ბანანი", "ფორთოხალი"] --

fruits = ["ვაშლი", "მსხალი", "ატამი", "ბალი", "ყურძენი", "ბანანი", "ფორთოხალი"]
print(fruits[2:5])

# 4) მოცემული გაქვთ რიცხვების სია. თქვენი დავალებაა for ციკლისა და if პირობის გამოყენებით სიაში იპოვოთ და დაბეჭდოთ მხოლოდ ლუწი (even) რიცხვები.
# -- mixed_nums = [12, 45, 8, 33, 91, 24, 10, 77] --

mixed_nums = [12, 45, 8, 33, 91, 24, 10, 77]

for i in mixed_nums:
    if i % 2 == 0:
        print(i)


# 5) კომენტარების დახმარებით ახსენით თუ რა არის ფუნქციები და რა დანიშნულება გააჩნიათ.

# ფუნქცია არის მრავალჯერადად გამოყენებადი კოდის ნაწილი,რომელსაც ვიყენებთ იმისთვის, რომ ერთი და იგივე კოდი არ დავწეროთ ბევრჯერ და კოდი იყოს მარტივად წასაკითხი.


# 6) კომენტარების დახმარებით ახსენით თუ რა არის ფუნქციების არგუმენტები, მოიყვანეთ მაგალითები.

# ფუნქციების არგუმენტები არის მნიშვნელობები,რომლებსაც ვაწვდით ფუნქციას ფრჩხილებში.მაგალითად
print(20) #print არის ფუნქცია,ხოლო არგუმენტი არის 20.


# 7) გააკეთეთ მაგალითები .lower() და .upper() ფუნქციებზე.

name='Natalia'
print(name.upper())
print(name.lower())

text = "Hello World"
print(text.upper())
print(text.lower())