#2)კომენტარების სახით ახსენით რა არის input-ი და output-ი, მოიყავნეთ შესაბამისი მაგალითები.

# input არის ის რაც მომხმარებელს შეყავს პროგრამაში მაგ: წლოვანება, სახელი.
age = int(input('შეიყვანეთ თქვენი ასაკი:'))
# output-ი არის შედეგი,რომელიც აისახება ეკრანზე.
print(age)

#3) შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ.

country =input('შეიყვანეთ თქვენი ქვეყანა:')
print(type(country))

#4) თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

city ='tbilisi'      # ცვლადი ინახავს  str მონაცემთა ტიპს
movie ='green book'  # ცვლადი ინახავს  str მონაცემთა ტიპს
food ='sushi'        # ცვლადი ინახავს  str მონაცემთა ტიპს
colour ='yellow'     # ცვლადი ინახავს  str მონაცემთა ტიპს
animal ='horse'      # ცვლადი ინახავს  str მონაცემთა ტიპს 

age = 18       # int  ინახავს მთელ რიცხვს
number = 30    # int  ინახავს მთელ რიცხვს
score = 100    # int  ინახავს მთელ რიცხვს
year =2026     # int  ინახავს მთელ რიცხვს
cars = 5       # int  ინახავს მთელ რიცხვს

height = 1.64        # float ინახავს ათწილად რიცხვს
Pi = 3.14            # float ინახავს ათწილად რიცხვს
temperature = 37.4   # float ინახავს ათწილად რიცხვს
weight = 43.4        # float ინახავს ათწილად რიცხვს
price = 9.99         # float ინახავს ათწილად რიცხვს
 

#5) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.


Brand = 'Nike'
print(type(Brand))

people = 100
print(type(people))

ice_cream_price = 1.5
print(type(ice_cream_price))

#6) მომხმარებელს შემოატანინეთ ორი სიტყვა, შეინახეთ ისინი ცვლადებში, მოახდინეთ მათი კონკატინაცია და დაბეჭდეთ.

name = input('enter your name:')
username =input('enter your username:')

print(' my name is ' + name +'  '+ username)

#7) მომხმარებელს შემოატანინეთ 5 რიცხვი სხვადასხვა დამოუკიდებელი input-ების სახით, თქვენი დავალებაა დაბეჭდოთ მათი საშუალო არითმეტიკული.

age = int(input('შეიყვანეთ თქვენი ასაკი:'))
fav_number =int(input('შეიყვანეთ საყვარელი რიცხვი:'))
year =int(input('შეიყვანეთ თქვენი წელი:'))
month =int(input('შეიყვანეთ თქვენი თვე:'))
day = int(input('შეიყვანეთ თქვენი დღე:'))

print((age + fav_number + year + month + day) / 5)

#8) მომხმარებელს შემოატანინეთ სახელი, გვარი, ასაკი, სიმაღლე, წონა და ამ მონაცემების გამოყენებით დაბეჭდეთ ერთი დიდი წინადადება.

name = input('შეიყვანეთ თქვენი სახელი:')
username = input ('შეიყვანეთ თქვენი გვარი:')
age = int(input('შეიყვანეთ თქვენი ასაკი:'))
height = float(input('შეიყვანეთ თქვენი სიმაღლე:'))
weight = float(input('შეიყვანეთ თქვენი წონა:'))


print('ჩემი სახელია ' + name + ' ' + username + ', ვარ ' + str(age) + ' წლის. ჩემი სიმაღლეა ' + str(height) + ' სმ, ხოლო წონა ' + str(weight) )