# 2) კომენტარებით ახსენით რა არის slicing.

# slicing-ის დახმარებით ჩვენ შეგვიძლია list-დან ან string-იდან ნაწილის ამოღება


# 3) შექმენი სია fruits = ["ვაშლი", "ბანანი", "ატამი", "მსხალი", "ალუბალი"] და დაბეჭდე მესამე ელემენტი

fruits = ["ვაშლი", "ბანანი", "ატამი", "მსხალი", "ალუბალი"] 
print(fruits[2])

# 4) შექმენი სია numbers = [10, 20, 30, 40, 50], შეცვალე მეორე ელემენტი 25-ით და დაბეჭდე განახლებული სია

numbers = [10, 20, 30, 40, 50]
numbers[1]=25
print(numbers)


# 5) მომხმარებელს შეაყვანინე ინდექსი (`0`-დან `4`-მდე) და დაბეჭდე შესაბამისი ელემენტი სიიდან colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "იასამნისფერი"]

colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "იასამნისფერი"]
index=int(input('Enter number from 0 to 4:'))
print(colors[index])


# 6) შექმენი სია animals = ["ძაღლი", "კატა", "სპილო", "ვეფხვი", "ლომი"], შეცვალე ბოლო ელემენტი "გემი"-თ და დაბეჭდე სია

animals = ["ძაღლი", "კატა", "სპილო", "ვეფხვი", "ლომი"]
animals[4]="გემი"
print(animals)


# 7) მომხმარებელს შეაყვანინე ინდექსი და ახალი ფერი, შეცვალე ამ ინდექსზე არსებული ფერი სიაში colors = ["თეთრი", "შავი", "ნარინჯისფერი", "ვარდისფერი"]` და დაბეჭდე განახლებული სია

colors = ["თეთრი", "შავი", "ნარინჯისფერი", "ვარდისფერი"]

index=int(input("Enter index:"))
new_color=input('Enter new color:')

colors[index]=new_color
print(colors)


