
# 1) შექმენით 5 ელემენტიანი სია და დაბეჭდეთ მისი მე-4 ელემენტი. (any index)
name=['Tako','Saba','Luka','Natali','Tiko']
print(name [3])

#2) შექმენით 5 ელემენტიანი სია, სადაც ჩაწერთ თქვენს საყვარელი მანქანების სახელს. ბოლოს გამოიტანეთ სიაში მყოფი პირველი და მესამე მნიშვნელობა. (დადებითი index-ებით)
cars=['Porsche','Ferrari','mercedes','BWM','Mazda']
print(cars [0] ,cars [2])

#3) შექმენით რიცხვების სია, სადაც ჩაწერთ 0-დან 10-ის ჩათვლით ყველა ლუწ რიცხვს. ბოლოს გამოიტანეთ სიაში მყოფი მეორე და მეოთხე მნიშვნელობა. (აურყოფითი index-ებით)
numbers=[0,2,4,6,8,10]
print(numbers[-5],numbers[-3])