#1) მომხმარებელს შემოატანინეთ input-ის მეშვეობით თავისი სახელი, შეინახეთ იგი ცვლადში და ბეჭდეთ მიღებული მნიშვნელობა.

#2) მომხარებელს შემოატანინეთ 2 ცალი რიცხვი სხვადასხვა დამოუკიდებელი input-ის მეშვეობით, ამის შემდეგ კი უბრალოდ დაბეჭდეთ ამ შემოყვანილი რიცხვების ჯამი. (დაგჭირდებათ int() ფუნქცია)

#3) მომხმარებელს შემოატანინეთ თავისი ასაკი, თქვენი დავალებაა შემოყვანილი მნიშვნელობა გადაიყვანოთ integer ტიპის მონმაცემად და საბოლოოდ დაბეჭდოთ მომხმარებლის მიერ შემოყვანილი მნიშვნელობის მონაცემთა ტიპი.

#4) შექმენით 3 ცვლადი, თითოულ ცვლადში შეინახეთ 1 მონაცემთა ტიპის მნიშვნელობა, თქვენი დავალებაა კი საბოლოოდ დაბეჭდოთ ამ ცვლადების მონაცემტა ტიპები.


#1
name = input('enter your name:')

print(name)

#2
num_1=int(input('enter  a number:'))
num_2=int(input('enter  a number:'))

print(num_1 + num_2)

#3
age=int(input('enter your age:'))
print(type(age))

#4
int = 10
str = 'world'
float = 3.14

print(type(int))
print(type(str))
print(type(float))