# 2) ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი,5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True
 
# 3) კომენტარის სახით დაწერეთ თუ რა არის sequancing,iteration,selection აღწერე თითეული მათგანი თქვენი სიტყვებით

# 4) მოიყვანე sequencing ის მაგალითი,და კომენტარით მიუწერე რატომ არის შენს მიერ მოყვანილი მაგალითი sequence

# 5) კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის

# 6) კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop

# 7) შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop

# 8) შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ

# 9) შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ

# 10) შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ

# # გამეორება / Revise -->

# 11) მომხმარებელს შემოატანინე 3 სტრინგ ტიპის და ერთი ინტეჯერ ტიპის მნიშვნელობები და შენი დავალებაა მოახდინო ამ ოთხი მნიშვნელობის კონკატინაცია(გამოიყენე შესაბამისი ფუნქცია რომ მოახდინოთ მონაცემთა ტიპიების გარდაქმნა ერთ მონაცემთა ტიპში რომ შეძლოთ კონკატინაცია)

# 12) შექმენი 4 ცვლადი,თითოეულში შეინახე განსხვავებული მონაცემთა ტიპები,შენი დავალებაა გაიგო ამ ცვლადებში შენახული მნიშვნელობის მონაცემთა ტიპი(გამოიყენე შესაბამისი ფუნქცია)

# 13) მომხმარებელს შემოატანინე 4 რიცხვი და ტერმინალში დააბრუნე ამ 4 რიცხვის ჯამი


# 2) ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი,5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True

(5 > 10)
(6 < 3)
(5 != 5)
(2 == 4) or (10 <= 5)
(4 >= 4) and (8 < 2 )

(20 > 5)
(5 < 8)
(7 == 7)
(3 >= 3) or (2 != 5)
(6 > 3) and (1 >= 1)


# 3) კომენტარის სახით დაწერეთ თუ რა არის sequancing,iteration,selection აღწერე თითეული მათგანი თქვენი სიტყვებით

# sequancing არის კოდის თანმიმდევრული წერა ზემოდან ქვემოთ. iteration არის კოდის გამეორება. selection არის არჩევა.


# 4) მოიყვანე sequencing ის მაგალითი,და კომენტარით მიუწერე რატომ არის შენს მიერ მოყვანილი მაგალითი sequence 

# ყოველდღიური ცხოვრების მაგალითი
print('გაღვიძება')
print('ჭამა')
print('მეცადინეობა,ვარჯიში')
print('დაძინება')

# ჩემს მიერ მოყვანილი მაგალითი sequencing იმიტომ არის, რომ ყველა ბრძანება რაც კი მიწერია სრულდება თანმიმდევრობით გამოტოვების გარეშე.


# 5) კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის

# for loop გამეორებას ნიშნავს და გვეხმარება იმაში,რომ ერთი და იგივე კოდი ბევრჯერ არ დავწეროთ.


# 6) კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop

# range() ფუნქციას გადაეცემა რიცხვების დიაპაზონი. for loop - თავიდან ვწერთ for-ს,შემდეგ ცვლადს, შემდეგ in-ს და ბოლოს ვწერთ range(),სადაც 
# იწერება რიცხვები თუ რამდენჯერ გვინდა კოდის დაწერა. 


# 7) შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop

for car in range(1,4):
    print('Porsche')

# 8) შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ

for surname in range(1,101):
    print('zhorzholiani')

# 9) შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ

for colour in range(1,47):
    print('Blue')

# 10) შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ

for letter in range(1,33):
    print('t')

# 11) მომხმარებელს შემოატანინე 3 სტრინგ ტიპის და ერთი ინტეჯერ ტიპის მნიშვნელობები და შენი დავალებაა მოახდინო ამ ოთხი მნიშვნელობის კონკატინაცია(გამოიყენე შესაბამისი ფუნქცია რომ მოახდინოთ მონაცემთა ტიპიების გარდაქმნა ერთ მონაცემთა ტიპში რომ შეძლოთ კონკატინაცია)

name=input('enter your name:')
surname=input('enter your surname:')
colour=input('enter your fav colour:')
age=int(input('enter your age:'))

print('my name is ' + name + ' ' + surname + ' i am ' +  str(age) + ' years old and my fav colour is ' + colour  )

# 12) შექმენი 4 ცვლადი,თითოეულში შეინახე განსხვავებული მონაცემთა ტიპები,შენი დავალებაა გაიგო ამ ცვლადებში შენახული მნიშვნელობის მონაცემთა ტიპი(გამოიყენე შესაბამისი ფუნქცია)

name='tako'
year=2007
height=1.57
human=True
print(type(name))
print(type(year))
print(type(height))
print(type(human))

# 13) მომხმარებელს შემოატანინე 4 რიცხვი და ტერმინალში დააბრუნე ამ 4 რიცხვის ჯამი

num1=int(input('enter number:'))
num2=int(input('enter number:'))
num3=int(input('enter number:'))
num4=int(input('enter number:'))

print(num1 + num2 + num3 + num4 )

