#2) კომენტარების სახით ჩამთვალეთ ყველა შედარებითი ოპერატორები და გააკეთეთ 5-5 ნაგალითი თითოეულზე.

#3) კომენტარების სახით ახსენით რა არის logical operators, ჩამოწერეთ თითოეული და განმარტეთ რომელი რა დროს რა შედეგს გვიბრუნებს.

#4) გააკეთეთ 3-3 მაგალითი logical operator-ებზე.

#5) მომხმარებელს შემოატანინეთ რიცხვი, შეინახეთ იგი ცვლადში და შეადარეთ იგი მეტია თუ არა თქვენს მიერ წინასწარ გამზადებულ რიცხვზე.

#6) მომხმარებელს შემოატანინეთ სახელი, შეინახეთ იგი ცვლადში და მკაცრად შეამოწმეთ უდრის თუ არა იგი თქვენს სახელს.

#7) მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ მეტია თუ არა იგი 18.

#2) 
# შედარებითი ოპერატორები- >, <, ==, !=, >=, <=

# > მეტია
print(10 > 5)
print(9 > 3)
print(4 > 2)
print(6 > 2)
print(3 > 1)

# < ნაკლებია
print(5 < 20)
print(4 < 9)
print(8 < 10)
print(15 < 20)
print(3 < 8)

# == ტოლია
print(5 == 5)
print(10 == 10)
print(2 == 2)
print(20 == 20)
print(7 == 7)

# != არ არის ტოლი
print(5 != 3)
print(4 != 1)
print(10 != 8)
print(30 != 10)
print(6 != 5)

# >= მეტი ან ტოლი
print(10 >= 5)
print(6 >= 6)
print(8 >= 3)
print(3 >= 3)
print(20 >= 10)

# <= ნაკლები ან ტოლი
print(3 <= 8)
print(4 <= 4)
print(2 <= 8)
print(10 <= 10)
print(1 <= 3)


#3)კომენტარების სახით ახსენით რა არის logical operators, ჩამოწერეთ თითოეული და განმარტეთ რომელი რა დროს რა შედეგს გვიბრუნებს.

# logical operators არის and და or 
print(True and False) # ეს გამოიტანს False
print(True and True)# ეს გამოიტანს True
print(False and False)# ეს გამოიტანს False 
print(False and True)# ეს გამოიტანს False

print(True or True)# ეს გამოიტანს True
print(True or False)# ეს გამოიტანს True
print(False or False)# ეს გამოიტანს False

#4)გააკეთეთ 3-3 მაგალითი logical operator-ებზე.

print(True and False)
print(False and False)
print(True and True)

print(True or False)
print(False or False)
print(True or True)

#5) მომხმარებელს შემოატანინეთ რიცხვი, შეინახეთ იგი ცვლადში და შეადარეთ იგი მეტია თუ არა თქვენს მიერ წინასწარ გამზადებულ რიცხვზე.

my_num = 10
num_1 = int(input('შეიყვანეთ რიცხვი:'))
print( my_num >= num_1 )

#6) მომხმარებელს შემოატანინეთ სახელი, შეინახეთ იგი ცვლადში და მკაცრად შეამოწმეთ უდრის თუ არა იგი თქვენს სახელს.

name = input('შეიყვანეთ თქვენი სახელი:')
my_name = 'Tako'
print(name == my_name)

#7) მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ მეტია თუ არა იგი 18.

age = int(input('შეიყვანეთ თქვენი ასაკი:'))
num = 18
print(age >= num)
