# 2) კომენტარებით ახსენით რა არის სია და როგორ უნდა შევქმნათ ის python-ში.

# სია არის ნებისმიერი რამის ჩამონათვალი.
name=['saba','gvanca']#-თავიდან წერ ცვლადს თუ რისი ჩამოთვლა გინდა,შემდეგ კვადრატულ ფრჩხილებში ჩამოთვლი.

# 3) კომენტარებით ახსენით რა არის index-ი.

# index-ი არის სიაში ელემენტის პოზიცია.

# 4) შექმენით 7 ელემენტიანი სახელების სია, შეცვალეთ 1-ლი და მე-5 ინდექსზე მდგომი ელემენტების მნიშვნელობა.

name=['levani','temo','nika','tiko','mari','nino','ana']
name[1]='gio'
name[5]='elene'
print(name)

# 5) შექმენით სია და შეიტანეთ შიგნით სხვადასხვა ელემენტები და გამოიტანეთ მე-2 ,მე-4 და მე-6 ელემენტები და ახსენით როგორ გამოგაქვთ.

list =[5,'apple',4,'orange',3,'banana','cherry']
print(list[1],list[3],list[5])
#ინდექსი იწყება 0-დან,ამიტომ მე-2 ელემენტის გამოსატანად ვწერ index 1-ს.


# 6) კომენტარებით ახსენით ასევე განსხვავება list-ს და ცვლადს შორის.

# ცვლადში ინახება ერთი მნიშვნელობა 
num=10 # num არის ცვლადი და ინახავს ერთ რიცხვს

# list-ში შეიძლება ბევრი მნიშვნელობის ერთად შენახვა

list=[1,2,3,'hello']