# 1) მოცემულია რიცხვების სია. გამოიყენეთ slicing, რომ ამოიღოთ სიიდან პირველი 3 რიცხვი.
# -- numbers = [10, 20, 30, 40, 50, 60, 70] --

numbers = [10, 20, 30, 40, 50, 60, 70] 
print(numbers[0:3])


# 2) მოცემულია string-ი. slicing-ის გამოყენებით ამოჭერით მხოლოდ სიტყვა "World".
# -- text = "Hello, World!" --

text = "Hello, World!"
print(text[6:12])


# 3) მოცემულია ფერების სია. გამოიყენეთ უარყოფითი ინდექსები, რათა სიიდან ამოიღოთ ბოლო 2 ფერი.
# -- colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "შავი"] --

colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "შავი"] 
print(colors[-2:])


# 4) მოცემულია string-ი. slicing-ის სპეციალური ხრიკის გამოყენებით, შემოატრიალეთ ტექსტი უკუღმა.
# -- word = "Python" --

word = "Python"
print(word[::-1])
