# 2) დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში 
for i in range(0,39):
    print(i)

# 3) დაატრილეთ for ციკლი 30 დან 40 მდე და გამოიტანე თითოეული რიცხვი ტერმინალში
for i in range(30,40):
    print(i)

# 4) დაატრიალეთ for ციკლი 12 იდან 120 მდე და გამოიტანე თითოეული რიცხვი ტერმინალში
for i in range(12,120):
    print(i)


# 5) დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ.
for i in range(18):
    print('tako')


# 6) დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში
for i in range(10,100,3):
    print(i)

# 7) ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ, მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი
for i in range(1,31):
    print(i, 'Blueberry')


# 8) მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop

age=int(input('enter your age:'))

for i in range(13):
    print(age)


# 9) გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით

i=0

while i < 10:
    print('tako')
    i += 1

# 10) დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop

i=0

while i < 24:
    print(i)
    i += 1

# 11) იმუშაოვეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ

for i in range(0,10,2):
    print(i)

for i in range(1,30):
    print(i)

for i in range(1,10,2):
    print(i)

i=0

while i < 10:
    print(i)
    i += 1

i=1

while i < 21:
    print(i)
    i += 1

  
