# 1) კომენტარების სახით ახსენით თუ რას აკეთებს .upper(), .lower() ფუნქციები.

# upper ფუნქცია ადიდებს სიტყვას,ხოლო lower ფუნქცია აპატარავებს სიტყვას


# 2) მომხმარებელს შემოატანინეთ თავისი სახელი. თქვენი დავალებაა მომხმარებელს ეს სახელი დაუბეჭდოთ მაღალ (upper) და დაბალ (lower) რეგისტრებში.

name = input("შეიყვანე შენი სახელი: ")
print(name.upper())
print(name.lower())

# 3) მოცემულია რიცხვების სია. გამოიყენეთ slicing, რომ ამოიღოთ სიიდან ყოველი მეორე რიცხვი.
# -- numbers = [10, 20, 30, 40, 50, 60, 70] --

numbers = [10, 20, 30, 40, 50, 60, 70]

print(numbers[0:7:2])